org/life/avoiding-mistakes-in-big-decisions.org
_via https://medium.com/@evolvable/how-to-avoid-making-huge-mistakes-with-life-s-big-decisions-2e9a71af00bc_

* The mistakes

*Property Resolution #1:* We would never purchase a property with shared walls again. If we shared a wall with someone, we wanted the freedom to leave at short notice.

*Property Resolution #2:* We would never purchase a property without first living in the immediate area. There’s too much you don’t know until you’ve been a local.

*Property Resolution #3:* We will tell our kids not to bother buying an apartment. Real estate transaction costs are astronomical, so if you’re planning to have a family, and to one day own a house, it might be better to just save for that house.

*Decision Mistake #1:* We hadn’t considered all our options. Once we started to look away from the beach, we saw one apartment, we liked the look of it, and we got railroaded into buying it by a really good salesman. We didn’t look at any other apartments in that suburb. We didn’t ever see any apartments in the suburb we’d planned to look in. Worst of all, we ended up spending more than we’d originally been thinking and it didn’t occur to us to go back to Cronulla to see what this new limit would afford us in the place we really wanted to live.

*Decision Mistake #2:* We weren’t clear on what features were really important to us. After seeing dozens of run-down places in Cronulla, we were blown away by the modern interior of the place we eventually bought. We realised too late that we’d traded that nice interior for things that we valued a lot more: a nice street, quiet surroundings and being near the beach.

* A better decision process

*#1 List your features:* We wrote down everything that we thought we would like as a feature in a house and property. We’d both lived in at least 5 places by now, and inspected scores more, so it was a pretty long list. We also wrote down things that we definitely didn’t want, but we wrote these as positive items — things we wanted — e.g. “Not next to a power substation.”

*#2 Sort your features:* We sorted the list of features, so that we had a list of most important features to least important. I actually wrote a small computer program that helped us do this by presenting features two at a time and making us choose which was more important. We asked ourselves: “If there were two identical houses except that one had this feature and the other house had the other feature, which would we choose?” We entered this into the program, and it sorted the list based on our answers.

*#3 Score your options:* For every house we visited, we scored the property for each feature out of 5 stars (no half stars allowed!). We kept the whole thing together in one spreadsheet. This gave us a commanding overview of the decision we were making.
