life/avoiding-mistakes-in-big-decisions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org571cce1">1. The mistakes</a></li>
<li><a href="#org1ae3e2b">2. A better decision process</a></li>
</ul>
</div>
</div>
<p>
<span class="underline">via <a href="https://medium.com/@evolvable/how-to-avoid-making-huge-mistakes-with-life-s-big-decisions-2e9a71af00bc">https://medium.com/@evolvable/how-to-avoid-making-huge-mistakes-with-life-s-big-decisions-2e9a71af00bc</a></span>
</p>

<div id="outline-container-org571cce1" class="outline-2">
<h2 id="org571cce1"><span class="section-number-2">1</span> The mistakes</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Property Resolution #1:</b> We would never purchase a property with shared walls again. If we shared a wall with someone, we wanted the freedom to leave at short notice.
</p>

<p>
<b>Property Resolution #2:</b> We would never purchase a property without first living in the immediate area. There’s too much you don’t know until you’ve been a local.
</p>

<p>
<b>Property Resolution #3:</b> We will tell our kids not to bother buying an apartment. Real estate transaction costs are astronomical, so if you’re planning to have a family, and to one day own a house, it might be better to just save for that house.
</p>

<p>
<b>Decision Mistake #1:</b> We hadn’t considered all our options. Once we started to look away from the beach, we saw one apartment, we liked the look of it, and we got railroaded into buying it by a really good salesman. We didn’t look at any other apartments in that suburb. We didn’t ever see any apartments in the suburb we’d planned to look in. Worst of all, we ended up spending more than we’d originally been thinking and it didn’t occur to us to go back to Cronulla to see what this new limit would afford us in the place we really wanted to live.
</p>

<p>
<b>Decision Mistake #2:</b> We weren’t clear on what features were really important to us. After seeing dozens of run-down places in Cronulla, we were blown away by the modern interior of the place we eventually bought. We realised too late that we’d traded that nice interior for things that we valued a lot more: a nice street, quiet surroundings and being near the beach.
</p>
</div>
</div>

<div id="outline-container-org1ae3e2b" class="outline-2">
<h2 id="org1ae3e2b"><span class="section-number-2">2</span> A better decision process</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>#1 List your features:</b> We wrote down everything that we thought we would like as a feature in a house and property. We’d both lived in at least 5 places by now, and inspected scores more, so it was a pretty long list. We also wrote down things that we definitely didn’t want, but we wrote these as positive items — things we wanted — e.g. “Not next to a power substation.”
</p>

<p>
<b>#2 Sort your features:</b> We sorted the list of features, so that we had a list of most important features to least important. I actually wrote a small computer program that helped us do this by presenting features two at a time and making us choose which was more important. We asked ourselves: “If there were two identical houses except that one had this feature and the other house had the other feature, which would we choose?” We entered this into the program, and it sorted the list based on our answers.
</p>

<p>
<b>#3 Score your options:</b> For every house we visited, we scored the property for each feature out of 5 stars (no half stars allowed!). We kept the whole thing together in one spreadsheet. This gave us a commanding overview of the decision we were making.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
